#include<bits/stdc++.h>
using namespace std;
int bitkid[1005][1005], t[1005][1005];  // 定义两个二维数组，bitkid用于存储地图信息，t用于标记访问情况int const dx[] = {0, 1, 0, -1}, dy[] = {1, 0, -1, 0};  // 定义表示四个方向的偏移量数组
int main(){   
 int noi;  // 定义一个变量noi，用于存储测试用例的数量   
 cin >> noi;  // 输入测试用例的数量
 while (noi--)  // 按照测试用例的数量进行循环   
 {      int n, m, k, x, y, d;  // 定义变量，分别表示地图的行数、列数、操作次数、起始位置的行和列以及初始方向        cin >> n >> m >> k;  // 输入地图的行数、列数和操作次数        cin >> x >> y >> d;  // 输入起始位置的行、列和初始方向
        char c;  // 定义字符变量用于接收输入        
        for (int i = 1; i <= n; i++)  // 外层循环遍历地图的行   
        {           
           for (int j = 1; j <= m; j++)  // 内层循环遍历地图的列   
           {       
            cin >> c;  // 输入地图中当前位置的字符         
              if (c == 'x')  // 如果字符为 'x'                   
                  bitkid[i][j] = 1;  // 将bitkid数组对应位置标记为 1        
              else                    
                 bitkid[i][j] = 0;  // 否则标记为 0              
                 t[i][j] = 0;  // 将t数组对应位置初始化为 0 
             }
		}
            t[x][y] = 1;  // 将起始位置在t数组中标记为 1
            for (int i = 0; i <= n + 1; i++)  // 处理地图的左右边界      
              {  
			    bitkid[i][0] = bitkid[i][m + 1] = 1;  // 将左右边界标记为 1 
			  }    
                for (int i = 0; i <= m + 1; i++)  // 处理地图的上下边界      
                 { 
				  bitkid[0][i] = bitkid[n + 1][i] = 1;  // 将上下边界标记为 1 
				 }
            while (k--)  // 按照操作次数进行循环      
             { 
			   if (bitkid[x + dx[d]][y + dy[d]])  // 如果当前方向的前方有障碍      
                 {
					  d = (d + 1) % 4;  // 改变方向 
				 }  
                else  // 如果前方无障碍         
                  {     x += dx[d];  // 按照当前方向移动行位置          
                        y += dy[d];  // 按照当前方向移动列位置     
				  }      
                  t[x][y] = 1;  // 将到达的位置在t数组中标记为 1
			  }
              int ans = 0;  // 定义变量用于存储结果       
              for (int i = 1; i <= n; i++)  // 外层循环遍历地图的行 
                 { 
				    for (int j = 1; j <= m; j++)  // 内层循环遍历地图的列   
                      {  
					  ans += t[i][j];  // 统计t数组中标记为 1 的数量
					  } 
			     }   
                cout << ans << endl;  // 输出结果 
	} 
   return 0;
 } 
